In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    np.arange(12).reshape(3,4),
    columns=['A','B','C','D']
)

In [3]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

### 1.单列drop

In [14]:
df.drop('A',axis='columns')

   B   C   D  sum_value
0  1   2   3          0
1  5   6   7        840
2  9  10  11       7920

### 2.单行drop

In [8]:
df.drop(0,axis=0)

   A  B   C   D
1  4  5   6   7
2  8  9  10  11

In [10]:
# axis指定了行，行会消失。得到每列的平均值
df.mean(axis='index')

A    4.0
B    5.0
C    6.0
D    7.0
dtype: float64

In [11]:
# axis指定了列，列会消失。得到每行的平均值
df.mean(axis=1)

0    1.5
1    5.5
2    9.5
dtype: float64

In [13]:
def get_sum_value(df): 
   return df['A']*df['B']*df['C']*df['D']

df['sum_value'] = df.apply(get_sum_value,axis=1)
df['sum_value']

0       0
1     840
2    7920
Name: sum_value, dtype: int64